WSM_I85B57/CFD/0/tf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      tf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 1 0 0 0 0];

internalField   nonuniform List<scalar> 
635
(
10.1918
10.1884
10.1782
10.1614
10.1316
10.1079
10.0835
10.0518
...
)
;

boundaryField
{
    wall_bottom
    {
        type            calculated;
        value           uniform 10.1929;
    }
    wall_top
    {
        type            zeroGradient;
    }
    front1
    {
        type            cyclic;
    }
    back1
    {
        type            cyclic;
    }
    left1
    {
        type            cyclic;
    }
    right1
    {
        type            cyclic;
    }
    front2
    {
        type            cyclic;
    }
    back2
    {
        type            cyclic;
    }
    left2
    {
        type            cyclic;
    }
    right2
    {
        type            cyclic;
    }
    front3
    {
        type            cyclic;
    }
    back3
    {
        type            cyclic;
    }
    left3
    {
        type            cyclic;
    }
    right3
    {
        type            cyclic;
    }
}


// ************************************************************************* //
